const data = [
    { name: "北京市", value: 19 },
    { name: "天津市", value: 10 },
    { name: "广州市", value: 17 },
    { name: "深圳市", value: 16 },
    { name: "成都市", value: 10 },
    { name: "西安市", value: 10 },
    { name: "南京市", value: 10 },
    { name: "武汉市", value: 10 },
    { name: "上海市", value: 18 },
    { name: "重庆市", value: 10 },
    { name: "沈阳市", value: 10 },
    { name: "广州市", value: 10 },
    { name: "青岛市", value: 10 },
    { name: "苏州市", value: 10 },
    { name: "郑州市", value: 10 },
    { name: "合肥市", value: 10 },
    { name: "长沙市", value: 10 },
    { name: "佛山市", value: 10 },
    { name: "东莞市", value: 10 },
    { name: "杭州市", value: 10 },
]
const LinesData = [
    {
        coords: [
            [115.89, 28.68],
            [116.46, 39.92],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [121.48, 31.22],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [113.23, 23.16],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [114.07, 22.62],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [118.767413, 32.041544],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [120.153576, 30.287459],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [119.306239, 26.075302],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [106.54, 29.59],
        ],
    },
    {
        coords: [
            [115.89, 28.68],
            [114.31, 30.52],
        ],
    },
]
const geoCoordMap = {
    北京市: [116.46, 39.92],
    上海市: [121.48, 31.22],
    广州市: [113.23, 23.16],
    深圳市: [114.07, 22.62],
    成都市: [104.06, 30.67],
    西安市: [108.95, 34.27],
    南京市: [118.78, 32.04],
    武汉市: [114.31, 30.52],
    重庆市: [106.54, 29.59],
    合肥市: [117.27, 31.86],
    长沙市: [113, 28.21],
    杭州市: [120.19, 30.26],
    东莞市: [113.75, 23.04],
    苏州市: [120.62, 31.32],
    郑州市: [113.65, 34.76],
    青岛市: [120.33, 36.07],
    佛山市: [113.11, 23.05],
    天津市: [117.2, 39.13],
    沈阳市: [123.38, 41.8],
    南昌市: [115.89, 28.68],
}

export { LinesData, data, geoCoordMap }
